Revit 2027 API
AnalysisDisplayDeformedShapeSettings.ShowGridLines Property
 If true, show grid lines in the analysis display.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGridLines { get; set; }
Public Property ShowGridLines As Boolean
	Get
	Set
public:
property bool ShowGridLines {
	bool get ();
	void set (bool value);
}
member ShowGridLines : bool with get, set
Property Value
Boolean
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace